In [32]:
# Data analysis and wrangling.
import pandas as pd
import numpy as np

# For MySQL queries on pandas dataframe.
from pandasql import sqldf
SQLite = lambda q: sqldf(q, globals())

# Suppress all the warnings
import warnings
warnings.filterwarnings("ignore")

In [33]:
users = pd.read_csv('Table-1 users.csv')

In [34]:
events = pd.read_csv('Table-2 events.csv')

In [35]:
email_events = pd.read_csv('Table-3 email_events.csv')

In [36]:
main_df = pd.read_excel("SQL Project-1 Table.xlsx")

In [37]:
users.head()

,user_id,created_at,company_id,language,activated_at,state
0,0.0,2013-01-01 20:59:39,5737.0,english,2013-01-01 21:01:07,active
1,1.0,2013-01-01 13:07:46,28.0,english,NaN,pending
2,2.0,2013-01-01 10:59:05,51.0,english,NaN,pending
3,3.0,2013-01-01 18:40:36,2800.0,german,2013-01-01 18:42:02,active
4,4.0,2013-01-01 14:37:51,5110.0,indian,2013-01-01 14:39:05,active

In [38]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19066 entries, 0 to 19065
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   user_id       19066 non-null  float64
 1   created_at    19066 non-null  object
 2   company_id    19066 non-null  float64
 3   language      19066 non-null  object
 4   activated_at  9381 non-null   object
 5   state         19066 non-null  object
dtypes: float64(2), object(4)
memory usage: 893.8+ KB

In [39]:
# Convert the datatype for `created_at`, `activated_at` columns to datetime64[ns]
users['created_at'] = pd.to_datetime(users['created_at'], errors = 'coerce')
users['activated_at'] = pd.to_datetime(users['activated_at'], errors = 'coerce')

# Convert the `user_id`, `company_id` column to integer type
users['user_id'] = users['user_id'].astype(np.int64)
users['company_id'] = users['company_id'].astype(np.int64)

In [40]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19066 entries, 0 to 19065
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   user_id       19066 non-null  int64
 1   created_at    19066 non-null  datetime64[ns]
 2   company_id    19066 non-null  int64
 3   language      19066 non-null  object
 4   activated_at  9381 non-null   datetime64[ns]
 5   state         19066 non-null  object
dtypes: datetime64[ns](2), int64(2), object(2)
memory usage: 893.8+ KB

In [41]:
events.head()

,user_id,occurred_at,event_type,event_name,location,device,user_type
0,10522.0,2014-05-02 11:02:39,engagement,login,Japan,dell inspiron notebook,3.0
1,10522.0,2014-05-02 11:02:53,engagement,home_page,Japan,dell inspiron notebook,3.0
2,10522.0,2014-05-02 11:03:28,engagement,like_message,Japan,dell inspiron notebook,3.0
3,10522.0,2014-05-02 11:04:09,engagement,view_inbox,Japan,dell inspiron notebook,3.0
4,10522.0,2014-05-02 11:03:16,engagement,search_run,Japan,dell inspiron notebook,3.0

In [42]:
events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340832 entries, 0 to 340831
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   user_id      340832 non-null  float64
 1   occurred_at  340832 non-null  object
 2   event_type   340832 non-null  object
 3   event_name   340832 non-null  object
 4   location     340832 non-null  object
 5   device       340832 non-null  object
 6   user_type    325255 non-null  float64
dtypes: float64(2), object(5)
memory usage: 18.2+ MB

In [43]:
# Convert the datatype for `occurred_at` column to datetime64[ns]
events['occurred_at'] = pd.to_datetime(events['occurred_at'], errors = 'coerce')

# Convert the `user_id` column to integer type
events['user_id'] = events['user_id'].astype('Int64')
events['user_type'] = events['user_type'].astype('Int64')

In [44]:
events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340832 entries, 0 to 340831
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   user_id      340832 non-null  Int64
 1   occurred_at  340832 non-null  datetime64[ns]
 2   event_type   340832 non-null  object
 3   event_name   340832 non-null  object
 4   location     340832 non-null  object
 5   device       340832 non-null  object
 6   user_type    325255 non-null  Int64
dtypes: Int64(2), datetime64[ns](1), object(4)
memory usage: 18.9+ MB

In [45]:
email_events.head(20)

    user_id          occurred_at              action  user_type
0       0.0  2014-05-06 09:30:00  sent_weekly_digest        1.0
1       0.0  2014-05-13 09:30:00  sent_weekly_digest        1.0
2       0.0  2014-05-20 09:30:00  sent_weekly_digest        1.0
3       0.0  2014-05-27 09:30:00  sent_weekly_digest        1.0
4       0.0  2014-06-03 09:30:00  sent_weekly_digest        1.0
5       0.0  2014-06-03 09:30:25          email_open        1.0
6       0.0  2014-06-10 09:30:00  sent_weekly_digest        1.0
7       0.0  2014-06-10 09:30:24          email_open        1.0
8       0.0  2014-06-17 09:30:00  sent_weekly_digest        1.0
9       0.0  2014-06-17 09:30:23          email_open        1.0
10      0.0  2014-06-24 09:30:00  sent_weekly_digest        1.0
11      0.0  2014-07-01 09:30:00  sent_weekly_digest        1.0
12      0.0  2014-07-08 09:30:00  sent_weekly_digest        1.0
13      0.0  2014-07-15 09:30:00  sent_weekly_digest        1.0
14      0.0  2014-07-22 09:30:00  sent_weekly_digest        1.0
15      0.0  2014-07-29 09:30:00  sent_weekly_digest        1.0
16      0.0  2014-07-29 09:30:35          email_open        1.0
17      0.0  2014-08-05 09:30:00  sent_weekly_digest        1.0
18      0.0  2014-08-12 09:30:00  sent_weekly_digest        1.0
19      0.0  2014-08-19 09:30:00  sent_weekly_digest        1.0

In [46]:
email_events['action'].value_counts()

sent_weekly_digest         57267
email_open                 20459
email_clickthrough          9010
sent_reengagement_email     3653
Name: action, dtype: int64

In [47]:
email_events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90389 entries, 0 to 90388
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   user_id      90389 non-null  float64
 1   occurred_at  90389 non-null  object
 2   action       90389 non-null  object
 3   user_type    90389 non-null  float64
dtypes: float64(2), object(2)
memory usage: 2.8+ MB

In [48]:
# Convert the datatype for `occurred_at` column to datetime64[ns]
email_events['occurred_at'] = pd.to_datetime(email_events['occurred_at'], errors = 'coerce')

# Convert the `user_id` column to integer type
email_events['user_id'] = email_events['user_id'].astype(np.int64)

In [49]:
main_df.head(10)

          ds  job_id  actor_id     event language  time_spent org
0 2020-11-30      21      1001      skip  English          15   A
1 2020-11-30      22      1006  transfer   Arabic          25   B
2 2020-11-29      23      1003  decision  Persian          20   C
3 2020-11-28      23      1005  transfer  Persian          22   D
4 2020-11-28      25      1002  decision    Hindi          11   B
5 2020-11-27      11      1007  decision   French         104   D
6 2020-11-26      23      1004      skip  Persian          56   A
7 2020-11-25      20      1003  transfer  Italian          45   C

In [50]:
main_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ds          8 non-null      datetime64[ns]
 1   job_id      8 non-null      int64
 2   actor_id    8 non-null      int64
 3   event       8 non-null      object
 4   language    8 non-null      object
 5   time_spent  8 non-null      int64
 6   org         8 non-null      object
dtypes: datetime64[ns](1), int64(3), object(3)
memory usage: 576.0+ bytes

In [51]:
# Convert the datatype for `ds` column to datetime64[ns]
main_df['ds'] = pd.to_datetime(main_df['ds'])

In [52]:
# Total No. of Distinct Job IDs:
SQLite('''
SELECT DISTINCT
        COUNT(job_id) AS 'Total no. of distinct job_id(s)'
FROM main_df;
''')

   Total no. of distinct job_id(s)
0                                8

##### **Case Study-1:**
<hr>

**Number of jobs reviewed:** Amount of jobs reviewed over time.

**Your task: 1. Calculate the number of jobs reviewed per hour per day for November 2020?**

In [53]:
SQLite('''
SELECT 
        strftime('%d/%m/%Y', ds) AS 'Datestamp',
        ROUND(1.0*COUNT(job_id)*3600/SUM(time_spent),2) AS '# Jobs reviewed/Hour/Day'
FROM main_df
WHERE event IN ('transfer','decision')
AND (ds >= '2020-11-01') AND (ds <= '2020-11-30')
GROUP BY ds;
''')

    Datestamp  # Jobs reviewed/Hour/Day
0  25/11/2020                     80.00
1  27/11/2020                     34.62
2  28/11/2020                    218.18
3  29/11/2020                    180.00

**Throughput:** It is the no. of events happening per second.

**Your task: 2. Let’s say the above metric is called throughput. Calculate 7 day rolling average of throughput? For throughput, do you prefer daily metric or 7-day rolling and why?**

In [68]:
SQLite('''
WITH CTE_throughput AS 
(SELECT
        strftime('%d/%m/%Y', ds) AS 'ds',
        COUNT(job_id) AS num_jobs,
        SUM(time_spent) AS total_time
FROM main_df
WHERE event IN('transfer','decision')
AND (ds >= '2020-11-01') AND (ds <= '2020-11-30')
GROUP BY ds)

SELECT 
        ds,
        (ROUND(1.0*SUM(num_jobs) OVER (ORDER BY ds ROWS BETWEEN 6 PRECEDING AND CURRENT ROW) /
        SUM(total_time) OVER (ORDER BY ds ROWS BETWEEN 6 PRECEDING AND CURRENT ROW),2)) 
        AS throughput_7d
FROM CTE_throughput;
''')

           ds  throughput_7d
0  25/11/2020           0.02
1  27/11/2020           0.01
2  28/11/2020           0.02
3  29/11/2020           0.02

**Percentage share of each language:** Share of each language for different contents.

**Your task: 3. Calculate the percentage share of each language in the last 30 days?**

In [54]:
## Without using window function:
SQLite('''
SELECT DISTINCT
        language AS 'Langauge',
        ROUND(((COUNT(language)*100.00)/(SELECT COUNT(*) FROM main_df 
        WHERE main_df.ds BETWEEN '2020-11-01' AND '2020-11-30')), 2) || '%' AS '% Language Share'
FROM main_df
WHERE main_df.ds BETWEEN '2020-11-01' AND '2020-11-30'
GROUP BY language
ORDER BY language ASC;
''')

  Langauge % Language Share
0   French           16.67%
1    Hindi           16.67%
2  Italian           16.67%
3  Persian            50.0%

**Duplicate rows:** Rows that have the same value present in them.

**Your task: 4. Let’s say you see some duplicate rows in the data. How will you display duplicates from the table?**

In [55]:
# There are no rows having duplicate values, but there are rows having same job_id.
SQLite('''
SELECT *
FROM main_df
GROUP BY ds, job_id, actor_id
HAVING COUNT(main_df.job_id) > 1;
''')

Empty DataFrame
Columns: [ds, job_id, actor_id, event, language, time_spent, org]
Index: []

##### **Case Study-2:**
<hr>

**User Engagement:** To measure the activeness of a user. Measuring if the user finds quality in a product/service.

**Your task: Calculate the weekly user engagement?**

In [56]:
SQLite('''
SELECT 
        CASE CAST (strftime('%w', E.occurred_at) AS INT)
                WHEN 0 THEN 'Sunday'
                WHEN 1 THEN 'Monday'
                WHEN 2 THEN 'Tuesday'
                WHEN 3 THEN 'Wednesday'
                WHEN 4 THEN 'Thursday'
                WHEN 5 THEN 'Friday'
                ELSE 'Saturday'
        END AS 'Day of week', 
        COUNT(DISTINCT E.user_id) AS 'No. of Weekly active users' 
FROM events AS E 
WHERE E.event_type = 'engagement' AND E.event_name = 'login' 
GROUP BY 1 
ORDER BY strftime('%w', E.occurred_at);
''')

  Day of week  No. of Weekly active users
0      Sunday                        1565
1      Monday                        3075
2     Tuesday                        3299
3   Wednesday                        3187
4    Thursday                        3297
5      Friday                        3560
6    Saturday                        2159

**User Growth:** Amount of users growing over time for a product.

**Your task: Calculate the user growth for product?**

In [57]:
# Product growth over different months for the year of 2013:
SQLite('''
SELECT 
        strftime('%m-%Y', U.created_at) AS 'Month',
        
        COUNT(*) AS all_users, 
        
        COUNT(CASE WHEN U.activated_at IS NOT NULL 
        THEN U.user_id ELSE NULL END) AS activated_users 
FROM users AS U
WHERE U.created_at BETWEEN '2013-01-01' AND '2013-12-31'
GROUP BY 1
ORDER BY 1;
''')

      Month  all_users  activated_users
0   01-2013        332              160
1   02-2013        328              160
2   03-2013        383              150
3   04-2013        410              181
4   05-2013        486              214
5   06-2013        485              213
6   07-2013        608              284
7   08-2013        636              316
8   09-2013        699              330
9   10-2013        826              390
10  11-2013        816              399
11  12-2013        935              464

In [58]:
# Product growth over different months for the year of 2013:
SQLite('''
SELECT 
        strftime('%m-%Y', U.created_at) AS 'Month',
        
        COUNT(*) AS all_users, 
        
        COUNT(CASE WHEN U.activated_at IS NOT NULL 
        THEN U.user_id ELSE NULL END) AS activated_users 
FROM users AS U
WHERE U.created_at BETWEEN '2014-01-01' AND '2014-12-31'
GROUP BY 1
ORDER BY 1;
''')

     Month  all_users  activated_users
0  01-2014       1083              552
1  02-2014       1054              525
2  03-2014       1231              615
3  04-2014       1419              726
4  05-2014       1597              779
5  06-2014       1728              873
6  07-2014       1983              997
7  08-2014       1990             1031

**Weekly Retention:** Users getting retained weekly after signing-up for a product.

**Your task: Calculate the weekly retention of users-sign up cohort?**

In [70]:
SQLite('''
SELECT 
        CASE CAST (strftime('%w', U.activated_at) AS INT)
                WHEN 0 THEN 'Sunday'
                WHEN 1 THEN 'Monday'
                WHEN 2 THEN 'Tuesday'
                WHEN 3 THEN 'Wednesday'
                WHEN 4 THEN 'Thursday'
                WHEN 5 THEN 'Friday'
                ELSE 'Saturday'
        END AS 'Day of week', 
        COUNT(DISTINCT U.user_id) AS 'No. of Weekly active users' 
FROM users AS U 
WHERE U.state = 'active'
GROUP BY 1 
ORDER BY strftime('%w', U.activated_at);
''')

  Day of week  No. of Weekly active users
0      Sunday                         486
1      Monday                        1661
2     Tuesday                        1621
3   Wednesday                        1694
4    Thursday                        1729
5      Friday                        1719
6    Saturday                         471

**Weekly Engagement:** To measure the activeness of a user. Measuring if the user finds quality in a product/service weekly.

**Your task: Calculate the weekly engagement per device?**

In [60]:
# Different devices used by the users:
SQLite('''
SELECT DISTINCT device
FROM events
ORDER BY 1
LIMIT 100;
''')

                    device
0      acer aspire desktop
1     acer aspire notebook
2        amazon fire phone
3          asus chromebook
4    dell inspiron desktop
5   dell inspiron notebook
6      hp pavilion desktop
7                  htc one
8                 ipad air
9                ipad mini
10               iphone 4s
11                iphone 5
12               iphone 5s
13             kindle fire
14         lenovo thinkpad
15                mac mini
16             macbook air
17             macbook pro
18                nexus 10
19                 nexus 5
20                 nexus 7
21         nokia lumia 635
22   samsumg galaxy tablet
23     samsung galaxy note
24       samsung galaxy s4
25         windows surface

In [61]:
# the weekly engagement of users per device
SQLite('''
SELECT 
        CASE CAST (strftime('%w', E.occurred_at) AS INT)
                WHEN 0 THEN 'Sunday'
                WHEN 1 THEN 'Monday'
                WHEN 2 THEN 'Tuesday'
                WHEN 3 THEN 'Wednesday'
                WHEN 4 THEN 'Thursday'
                WHEN 5 THEN 'Friday'
                ELSE 'Saturday'
        END AS 'Day of week',
        
        COUNT(DISTINCT E.user_id) AS 'weekly active users', 
        
        COUNT(DISTINCT CASE WHEN E.device 
                IN('asus chromebook', 'acer aspire notebook','acer aspire desktop', 
                'dell inspiron notebook', 'dell inspiron desktop', 'hp pavilion desktop', 
                'macbook pro', 'macbook air', 'mac mini', 'lenovo thinkpad') 
                THEN E.user_id ELSE NULL END) AS 'Computer',
        
        COUNT(DISTINCT CASE WHEN E.device 
                IN('iphone 5', 'samsung galaxy s4', 'nexus 5', 'iphone 5s', 'iphone 4s',
                'nokia lumia 635', 'htc one', 'samsung galaxy note', 'amazon fire phone') 
                THEN E.user_id ELSE NULL END) AS 'Phone', 
        
        COUNT(DISTINCT CASE WHEN E.device 
                IN('ipad air','nexus 7','ipad mini', 'nexus 10', 
                'kindle fire', 'windows surface', 'samsung galaxy tablet') 
                THEN E.user_id ELSE NULL END) AS 'Tablet' 
FROM events AS E 
WHERE E.event_type = 'engagement' AND E.event_name = 'login' 
GROUP BY 1
ORDER BY strftime('%w', E.occurred_at)
LIMIT 150;
''')

  Day of week  weekly active users  Computer  Phone  Tablet
0      Sunday                 1565       945    525     197
1      Monday                 3075      2060   1346     527
2     Tuesday                 3299      2272   1481     572
3   Wednesday                 3187      2219   1467     537
4    Thursday                 3297      2296   1553     568
5      Friday                 3560      2469   1717     647
6    Saturday                 2159      1328    868     329

**Email Engagement:** Users engaging with the email service.

**Your task: Calculate the email engagement metrics?**

In [62]:
SQLite('''
SELECT 
        CASE CAST (strftime('%w', E.occurred_at) AS INT)
                WHEN 0 THEN 'Sunday'
                WHEN 1 THEN 'Monday'
                WHEN 2 THEN 'Tuesday'
                WHEN 3 THEN 'Wednesday'
                WHEN 4 THEN 'Thursday'
                WHEN 5 THEN 'Friday'
                ELSE 'Saturday'
        END AS 'Day of week', 
        
        COUNT(CASE WHEN E.action = 'sent_weekly_digest' 
        THEN E.user_id ELSE NULL END) AS 'weekly emails',
        
        COUNT(CASE WHEN E.action = 'sent_reengagement_email' 
        THEN E.user_id ELSE NULL END) AS 'reengagement emails', 
        
        COUNT(CASE WHEN E.action = 'email_open' 
        THEN E.user_id ELSE NULL END) AS 'emails opened', 
        
        COUNT(CASE WHEN E.action = 'email_clickthrough' 
        THEN E.user_id ELSE NULL END) AS 'email clickthroughs' 
FROM email_events AS E 
GROUP BY 1
ORDER BY strftime('%w', E.occurred_at);
''')

,Day of week,weekly emails,reengagement emails,emails opened,email clickthroughs
0,Sunday,0,711,619,565
1,Monday,15927,635,5431,2230
2,Tuesday,10323,660,3711,1649
3,Wednesday,9620,169,2996,1110
4,Thursday,10883,177,3430,1289
5,Friday,10514,666,3711,1651
6,Saturday,0,635,561,516